---
type: ExternalCommandData
namespace: Autodesk.Revit.UI
version: 2024
members: 3
tags: [revit-api, class]
---

# ExternalCommandData

`Autodesk.Revit.UI.ExternalCommandData` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | Application | — | `public UIApplication Application { get ; set ; }` |
| Property | JournalData | — | `public IDictionary < string , string > JournalData { get ; set ; }` |
| Property | View | — | `public View View { get ; set ; }` |